
# Call the endpoint using requests library
Using ExchangeRate-API extract currency exchange rate data.

In [3]:
#!mamba install pandas==1.3.3 -y
#!mamba install requests==2.26.0 -y
import requests
import pandas as pd
url = "https://api.apilayer.com/exchangerates_data/latest?base=EUR&apikey=9R4iaQHnzXtTPsgZIhGrGBHkdTdvc6x2" 
result = requests.get(url).text

# Save as DataFrame
Using the data gathered turn it into a pandas dataframe. The dataframe should have the Currency as the index and Rate as their columns. Making sure to drop unnecessary columns

In [4]:
# Turn the data into a dataframe
import json
data = json.loads(result)
df = pd.DataFrame(data)
df.head()

     success   timestamp base        date       rates
AED     True  1676587083  EUR  2023-02-16    3.919130
AFN     True  1676587083  EUR  2023-02-16   96.032642
ALL     True  1676587083  EUR  2023-02-16  115.560618
AMD     True  1676587083  EUR  2023-02-16  420.283756
ANG     True  1676587083  EUR  2023-02-16    1.923011

In [5]:
# Drop unnescessary columns
df2 = df[['rates']]
df2

           rates
AED     3.919130
AFN    96.032642
ALL   115.560618
AMD   420.283756
ANG     1.923011
..           ...
YER   267.074383
ZAR    19.369890
ZMK  9604.456579
ZMW    20.705009
ZWL   343.581675

[170 rows x 1 columns]

# Load the Data
Using the dataframe save it as a CSV names exchange_rates_1.csv

In [6]:
# Save the Dataframe
df2.to_csv("exchange_rates_1.csv")